identification division.
    program-id. 
    screenformat.
    environment division.
    input-output section.
    file-control.
        select fileInput assign to filename
                organization is sequential.
    data division.
    file section.


    procedure division chaining filename.
    begin.




    stop run.